Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/multisensor/firmware/src/packs/WBZ351_DFP/component/dgi_spi.h
/*
 * Component description for DGI_SPI
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-02-18T06:25:25Z  */
#ifndef _WBZ35_DGI_SPI_COMPONENT_H_
#define _WBZ35_DGI_SPI_COMPONENT_H_

/* ************************************************************************** */
/*                    SOFTWARE API DEFINITION FOR DGI_SPI                     */
/* ************************************************************************** */

/* -------- DGI_SPI_SPICON : (DGI_SPI Offset: 0x00) (R/W 32) SPI control register -------- */
#define DGI_SPI_SPICON_RESETVALUE             _UINT32_(0x00)                                       /*  (DGI_SPI_SPICON) SPI control register  Reset Value */

#define DGI_SPI_SPICON_GO_Pos                 _UINT32_(0)                                          /* (DGI_SPI_SPICON) DMA Operation Status bitThis bit is set by the user software to start the DMA operation. It is reset back to zero by the DMA engine whenthe DMA operation is completed or aborted by clearing the ON bit. Position */
#define DGI_SPI_SPICON_GO_Msk                 (_UINT32_(0x1) << DGI_SPI_SPICON_GO_Pos)             /* (DGI_SPI_SPICON) DMA Operation Status bitThis bit is set by the user software to start the DMA operation. It is reset back to zero by the DMA engine whenthe DMA operation is completed or aborted by clearing the ON bit. Mask */
#define DGI_SPI_SPICON_GO(value)              (DGI_SPI_SPICON_GO_Msk & (_UINT32_(value) << DGI_SPI_SPICON_GO_Pos)) /* Assigment of value for GO in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_GO_0_Val             _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) DMA is not in operation  */
#define   DGI_SPI_SPICON_GO_1_Val             _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) DMA is in operation  */
#define DGI_SPI_SPICON_GO_0                   (DGI_SPI_SPICON_GO_0_Val << DGI_SPI_SPICON_GO_Pos)   /* (DGI_SPI_SPICON) DMA is not in operation Position  */
#define DGI_SPI_SPICON_GO_1                   (DGI_SPI_SPICON_GO_1_Val << DGI_SPI_SPICON_GO_Pos)   /* (DGI_SPI_SPICON) DMA is in operation Position  */
#define DGI_SPI_SPICON_STXISEL_Pos            _UINT32_(2)                                          /* (DGI_SPI_SPICON) SPI Transmit Service Request Interrupt SelectFor enhanced buffer mode, the SPI generates a Transmit Service Request when: Position */
#define DGI_SPI_SPICON_STXISEL_Msk            (_UINT32_(0x3) << DGI_SPI_SPICON_STXISEL_Pos)        /* (DGI_SPI_SPICON) SPI Transmit Service Request Interrupt SelectFor enhanced buffer mode, the SPI generates a Transmit Service Request when: Mask */
#define DGI_SPI_SPICON_STXISEL(value)         (DGI_SPI_SPICON_STXISEL_Msk & (_UINT32_(value) << DGI_SPI_SPICON_STXISEL_Pos)) /* Assigment of value for STXISEL in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_STXISEL_0_Val        _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) The SPIxTXB is empty and SPIxSR is empty (i.e. all transmit operations are complete)  */
#define   DGI_SPI_SPICON_STXISEL_1_Val        _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) The SPIxTXB is empty  */
#define   DGI_SPI_SPICON_STXISEL_2_Val        _UINT32_(0x2)                                        /* (DGI_SPI_SPICON) The SPIxTXB is at least half empty  */
#define   DGI_SPI_SPICON_STXISEL_3_Val        _UINT32_(0x3)                                        /* (DGI_SPI_SPICON) The SPIxTXB is not full  */
#define DGI_SPI_SPICON_STXISEL_0              (DGI_SPI_SPICON_STXISEL_0_Val << DGI_SPI_SPICON_STXISEL_Pos) /* (DGI_SPI_SPICON) The SPIxTXB is empty and SPIxSR is empty (i.e. all transmit operations are complete) Position  */
#define DGI_SPI_SPICON_STXISEL_1              (DGI_SPI_SPICON_STXISEL_1_Val << DGI_SPI_SPICON_STXISEL_Pos) /* (DGI_SPI_SPICON) The SPIxTXB is empty Position  */
#define DGI_SPI_SPICON_STXISEL_2              (DGI_SPI_SPICON_STXISEL_2_Val << DGI_SPI_SPICON_STXISEL_Pos) /* (DGI_SPI_SPICON) The SPIxTXB is at least half empty Position  */
#define DGI_SPI_SPICON_STXISEL_3              (DGI_SPI_SPICON_STXISEL_3_Val << DGI_SPI_SPICON_STXISEL_Pos) /* (DGI_SPI_SPICON) The SPIxTXB is not full Position  */
#define DGI_SPI_SPICON_CKP_Pos                _UINT32_(6)                                          /* (DGI_SPI_SPICON) Clock Polarity Select bit Position */
#define DGI_SPI_SPICON_CKP_Msk                (_UINT32_(0x1) << DGI_SPI_SPICON_CKP_Pos)            /* (DGI_SPI_SPICON) Clock Polarity Select bit Mask */
#define DGI_SPI_SPICON_CKP(value)             (DGI_SPI_SPICON_CKP_Msk & (_UINT32_(value) << DGI_SPI_SPICON_CKP_Pos)) /* Assigment of value for CKP in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_CKP_0_Val            _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Idle state for clock is a low level; active state is a high level  */
#define   DGI_SPI_SPICON_CKP_1_Val            _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) Idle state for clock is a high level; active state is a low level  */
#define DGI_SPI_SPICON_CKP_0                  (DGI_SPI_SPICON_CKP_0_Val << DGI_SPI_SPICON_CKP_Pos) /* (DGI_SPI_SPICON) Idle state for clock is a low level; active state is a high level Position  */
#define DGI_SPI_SPICON_CKP_1                  (DGI_SPI_SPICON_CKP_1_Val << DGI_SPI_SPICON_CKP_Pos) /* (DGI_SPI_SPICON) Idle state for clock is a high level; active state is a low level Position  */
#define DGI_SPI_SPICON_SSCON_Pos              _UINT32_(7)                                          /* (DGI_SPI_SPICON) SSControl bits Position */
#define DGI_SPI_SPICON_SSCON_Msk              (_UINT32_(0x1) << DGI_SPI_SPICON_SSCON_Pos)          /* (DGI_SPI_SPICON) SSControl bits Mask */
#define DGI_SPI_SPICON_SSCON(value)           (DGI_SPI_SPICON_SSCON_Msk & (_UINT32_(value) << DGI_SPI_SPICON_SSCON_Pos)) /* Assigment of value for SSCON in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_SSCON_0_Val          _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) SS is not controlled by the DMA module  */
#define   DGI_SPI_SPICON_SSCON_1_Val          _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) SS is asserted for the duration of TXCNT  */
#define DGI_SPI_SPICON_SSCON_0                (DGI_SPI_SPICON_SSCON_0_Val << DGI_SPI_SPICON_SSCON_Pos) /* (DGI_SPI_SPICON) SS is not controlled by the DMA module Position  */
#define DGI_SPI_SPICON_SSCON_1                (DGI_SPI_SPICON_SSCON_1_Val << DGI_SPI_SPICON_SSCON_Pos) /* (DGI_SPI_SPICON) SS is asserted for the duration of TXCNT Position  */
#define DGI_SPI_SPICON_CKE_Pos                _UINT32_(8)                                          /* (DGI_SPI_SPICON) SPI Clock Edge Select bit Position */
#define DGI_SPI_SPICON_CKE_Msk                (_UINT32_(0x1) << DGI_SPI_SPICON_CKE_Pos)            /* (DGI_SPI_SPICON) SPI Clock Edge Select bit Mask */
#define DGI_SPI_SPICON_CKE(value)             (DGI_SPI_SPICON_CKE_Msk & (_UINT32_(value) << DGI_SPI_SPICON_CKE_Pos)) /* Assigment of value for CKE in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_CKE_0_Val            _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Transmit happens on transition from idle clock state to active clock stat e  */
#define   DGI_SPI_SPICON_CKE_1_Val            _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) Transmit happens on transition from active clock state to idle clock state  */
#define DGI_SPI_SPICON_CKE_0                  (DGI_SPI_SPICON_CKE_0_Val << DGI_SPI_SPICON_CKE_Pos) /* (DGI_SPI_SPICON) Transmit happens on transition from idle clock state to active clock stat e Position  */
#define DGI_SPI_SPICON_CKE_1                  (DGI_SPI_SPICON_CKE_1_Val << DGI_SPI_SPICON_CKE_Pos) /* (DGI_SPI_SPICON) Transmit happens on transition from active clock state to idle clock state Position  */
#define DGI_SPI_SPICON_MODE_Pos               _UINT32_(10)                                         /* (DGI_SPI_SPICON) Serial Word Length bits Position */
#define DGI_SPI_SPICON_MODE_Msk               (_UINT32_(0x3) << DGI_SPI_SPICON_MODE_Pos)           /* (DGI_SPI_SPICON) Serial Word Length bits Mask */
#define DGI_SPI_SPICON_MODE(value)            (DGI_SPI_SPICON_MODE_Msk & (_UINT32_(value) << DGI_SPI_SPICON_MODE_Pos)) /* Assigment of value for MODE in the DGI_SPI_SPICON register */
#define DGI_SPI_SPICON_DISSDO_Pos             _UINT32_(12)                                         /* (DGI_SPI_SPICON) Disable SDO bit Position */
#define DGI_SPI_SPICON_DISSDO_Msk             (_UINT32_(0x1) << DGI_SPI_SPICON_DISSDO_Pos)         /* (DGI_SPI_SPICON) Disable SDO bit Mask */
#define DGI_SPI_SPICON_DISSDO(value)          (DGI_SPI_SPICON_DISSDO_Msk & (_UINT32_(value) << DGI_SPI_SPICON_DISSDO_Pos)) /* Assigment of value for DISSDO in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_DISSDO_0_Val         _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) SDO pin is controlled by the macro  */
#define   DGI_SPI_SPICON_DISSDO_1_Val         _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) SDO pin is not used by the macro. Pin controlled by PORT function  */
#define DGI_SPI_SPICON_DISSDO_0               (DGI_SPI_SPICON_DISSDO_0_Val << DGI_SPI_SPICON_DISSDO_Pos) /* (DGI_SPI_SPICON) SDO pin is controlled by the macro Position  */
#define DGI_SPI_SPICON_DISSDO_1               (DGI_SPI_SPICON_DISSDO_1_Val << DGI_SPI_SPICON_DISSDO_Pos) /* (DGI_SPI_SPICON) SDO pin is not used by the macro. Pin controlled by PORT function Position  */
#define DGI_SPI_SPICON_SIDL_Pos               _UINT32_(13)                                         /* (DGI_SPI_SPICON) Stop in Idle control bit Position */
#define DGI_SPI_SPICON_SIDL_Msk               (_UINT32_(0x1) << DGI_SPI_SPICON_SIDL_Pos)           /* (DGI_SPI_SPICON) Stop in Idle control bit Mask */
#define DGI_SPI_SPICON_SIDL(value)            (DGI_SPI_SPICON_SIDL_Msk & (_UINT32_(value) << DGI_SPI_SPICON_SIDL_Pos)) /* Assigment of value for SIDL in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_SIDL_0_Val           _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Continue to operate in CPU Idle mode  */
#define   DGI_SPI_SPICON_SIDL_1_Val           _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) Halt in CPU Idle mode  */
#define DGI_SPI_SPICON_SIDL_0                 (DGI_SPI_SPICON_SIDL_0_Val << DGI_SPI_SPICON_SIDL_Pos) /* (DGI_SPI_SPICON) Continue to operate in CPU Idle mode Position  */
#define DGI_SPI_SPICON_SIDL_1                 (DGI_SPI_SPICON_SIDL_1_Val << DGI_SPI_SPICON_SIDL_Pos) /* (DGI_SPI_SPICON) Halt in CPU Idle mode Position  */
#define DGI_SPI_SPICON_FRZ_Pos                _UINT32_(14)                                         /* (DGI_SPI_SPICON) Freeze bit (in Debug Mode) Position */
#define DGI_SPI_SPICON_FRZ_Msk                (_UINT32_(0x1) << DGI_SPI_SPICON_FRZ_Pos)            /* (DGI_SPI_SPICON) Freeze bit (in Debug Mode) Mask */
#define DGI_SPI_SPICON_FRZ(value)             (DGI_SPI_SPICON_FRZ_Msk & (_UINT32_(value) << DGI_SPI_SPICON_FRZ_Pos)) /* Assigment of value for FRZ in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_FRZ_0_Val            _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Continue macro operation when in Debug mode  */
#define   DGI_SPI_SPICON_FRZ_1_Val            _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) Break macro operation when in Debug mode  */
#define DGI_SPI_SPICON_FRZ_0                  (DGI_SPI_SPICON_FRZ_0_Val << DGI_SPI_SPICON_FRZ_Pos) /* (DGI_SPI_SPICON) Continue macro operation when in Debug mode Position  */
#define DGI_SPI_SPICON_FRZ_1                  (DGI_SPI_SPICON_FRZ_1_Val << DGI_SPI_SPICON_FRZ_Pos) /* (DGI_SPI_SPICON) Break macro operation when in Debug mode Position  */
#define DGI_SPI_SPICON_ON_Pos                 _UINT32_(15)                                         /* (DGI_SPI_SPICON) DGISPI On bit Position */
#define DGI_SPI_SPICON_ON_Msk                 (_UINT32_(0x1) << DGI_SPI_SPICON_ON_Pos)             /* (DGI_SPI_SPICON) DGISPI On bit Mask */
#define DGI_SPI_SPICON_ON(value)              (DGI_SPI_SPICON_ON_Msk & (_UINT32_(value) << DGI_SPI_SPICON_ON_Pos)) /* Assigment of value for ON in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_ON_0_Val             _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Turn off and reset macro, disable clocks, disable interrupt event generation, allow SFR modifications.  */
#define   DGI_SPI_SPICON_ON_1_Val             _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) Enable macro  */
#define DGI_SPI_SPICON_ON_0                   (DGI_SPI_SPICON_ON_0_Val << DGI_SPI_SPICON_ON_Pos)   /* (DGI_SPI_SPICON) Turn off and reset macro, disable clocks, disable interrupt event generation, allow SFR modifications. Position  */
#define DGI_SPI_SPICON_ON_1                   (DGI_SPI_SPICON_ON_1_Val << DGI_SPI_SPICON_ON_Pos)   /* (DGI_SPI_SPICON) Enable macro Position  */
#define DGI_SPI_SPICON_ENHBUF_Pos             _UINT32_(16)                                         /* (DGI_SPI_SPICON) Enhanced Buffer Enable bit Position */
#define DGI_SPI_SPICON_ENHBUF_Msk             (_UINT32_(0x1) << DGI_SPI_SPICON_ENHBUF_Pos)         /* (DGI_SPI_SPICON) Enhanced Buffer Enable bit Mask */
#define DGI_SPI_SPICON_ENHBUF(value)          (DGI_SPI_SPICON_ENHBUF_Msk & (_UINT32_(value) << DGI_SPI_SPICON_ENHBUF_Pos)) /* Assigment of value for ENHBUF in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_ENHBUF_0_Val         _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Enhanced Buffer Mode is disabled  */
#define   DGI_SPI_SPICON_ENHBUF_1_Val         _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) Enhanced Buffer Mode is enabled  */
#define DGI_SPI_SPICON_ENHBUF_0               (DGI_SPI_SPICON_ENHBUF_0_Val << DGI_SPI_SPICON_ENHBUF_Pos) /* (DGI_SPI_SPICON) Enhanced Buffer Mode is disabled Position  */
#define DGI_SPI_SPICON_ENHBUF_1               (DGI_SPI_SPICON_ENHBUF_1_Val << DGI_SPI_SPICON_ENHBUF_Pos) /* (DGI_SPI_SPICON) Enhanced Buffer Mode is enabled Position  */
#define DGI_SPI_SPICON_MCLKEN_Pos             _UINT32_(23)                                         /* (DGI_SPI_SPICON) Master Clock Enable Position */
#define DGI_SPI_SPICON_MCLKEN_Msk             (_UINT32_(0x1) << DGI_SPI_SPICON_MCLKEN_Pos)         /* (DGI_SPI_SPICON) Master Clock Enable Mask */
#define DGI_SPI_SPICON_MCLKEN(value)          (DGI_SPI_SPICON_MCLKEN_Msk & (_UINT32_(value) << DGI_SPI_SPICON_MCLKEN_Pos)) /* Assigment of value for MCLKEN in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_MCLKEN_0_Val         _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) PBCLK is used by the BRG  */
#define   DGI_SPI_SPICON_MCLKEN_1_Val         _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) MCLK is used by the BRG  */
#define DGI_SPI_SPICON_MCLKEN_0               (DGI_SPI_SPICON_MCLKEN_0_Val << DGI_SPI_SPICON_MCLKEN_Pos) /* (DGI_SPI_SPICON) PBCLK is used by the BRG Position  */
#define DGI_SPI_SPICON_MCLKEN_1               (DGI_SPI_SPICON_MCLKEN_1_Val << DGI_SPI_SPICON_MCLKEN_Pos) /* (DGI_SPI_SPICON) MCLK is used by the BRG Position  */
#define DGI_SPI_SPICON_MSSEN_Pos              _UINT32_(28)                                         /* (DGI_SPI_SPICON) Master Mode Slave Select Enable bit Position */
#define DGI_SPI_SPICON_MSSEN_Msk              (_UINT32_(0x1) << DGI_SPI_SPICON_MSSEN_Pos)          /* (DGI_SPI_SPICON) Master Mode Slave Select Enable bit Mask */
#define DGI_SPI_SPICON_MSSEN(value)           (DGI_SPI_SPICON_MSSEN_Msk & (_UINT32_(value) << DGI_SPI_SPICON_MSSEN_Pos)) /* Assigment of value for MSSEN in the DGI_SPI_SPICON register */
#define   DGI_SPI_SPICON_MSSEN_0_Val          _UINT32_(0x0)                                        /* (DGI_SPI_SPICON) Slave select SPI support disabled  */
#define   DGI_SPI_SPICON_MSSEN_1_Val          _UINT32_(0x1)                                        /* (DGI_SPI_SPICON) SPI Slave Select support enabled   */
#define DGI_SPI_SPICON_MSSEN_0                (DGI_SPI_SPICON_MSSEN_0_Val << DGI_SPI_SPICON_MSSEN_Pos) /* (DGI_SPI_SPICON) Slave select SPI support disabled Position  */
#define DGI_SPI_SPICON_MSSEN_1                (DGI_SPI_SPICON_MSSEN_1_Val << DGI_SPI_SPICON_MSSEN_Pos) /* (DGI_SPI_SPICON) SPI Slave Select support enabled  Position  */
#define DGI_SPI_SPICON_Msk                    _UINT32_(0x1081FDCD)                                 /* (DGI_SPI_SPICON) Register Mask  */


