Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/multisensor/firmware/src/packs/WBZ351_DFP/component/dgi_spi.h
/* -------- DGI_SPI_SPIBRG : (DGI_SPI Offset: 0x30) (R/W 32) SPI Baud rate register -------- */
#define DGI_SPI_SPIBRG_RESETVALUE             _UINT32_(0x00)                                       /*  (DGI_SPI_SPIBRG) SPI Baud rate register  Reset Value */

#define DGI_SPI_SPIBRG_BRG_Pos                _UINT32_(0)                                          /* (DGI_SPI_SPIBRG) Baud Rate Divisor bitsseeSection 2.4.1. Position */
#define DGI_SPI_SPIBRG_BRG_Msk                (_UINT32_(0x1FFF) << DGI_SPI_SPIBRG_BRG_Pos)         /* (DGI_SPI_SPIBRG) Baud Rate Divisor bitsseeSection 2.4.1. Mask */
#define DGI_SPI_SPIBRG_BRG(value)             (DGI_SPI_SPIBRG_BRG_Msk & (_UINT32_(value) << DGI_SPI_SPIBRG_BRG_Pos)) /* Assignment of value for BRG in the DGI_SPI_SPIBRG register */
#define DGI_SPI_SPIBRG_Msk                    _UINT32_(0x00001FFF)                                 /* (DGI_SPI_SPIBRG) Register Mask  */


/* -------- DGI_SPI_SPITXADD : (DGI_SPI Offset: 0x40) (R/W 32) SPI DMA Transmit Address register -------- */
#define DGI_SPI_SPITXADD_RESETVALUE           _UINT32_(0x00)                                       /*  (DGI_SPI_SPITXADD) SPI DMA Transmit Address register  Reset Value */

#define DGI_SPI_SPITXADD_TXADD_Pos            _UINT32_(0)                                          /* (DGI_SPI_SPITXADD) Transmit Source Address bitsTXADD can constantly be updated to reflect the current transmit address as the transfer progresses Position */
#define DGI_SPI_SPITXADD_TXADD_Msk            (_UINT32_(0xFFFF) << DGI_SPI_SPITXADD_TXADD_Pos)     /* (DGI_SPI_SPITXADD) Transmit Source Address bitsTXADD can constantly be updated to reflect the current transmit address as the transfer progresses Mask */
#define DGI_SPI_SPITXADD_TXADD(value)         (DGI_SPI_SPITXADD_TXADD_Msk & (_UINT32_(value) << DGI_SPI_SPITXADD_TXADD_Pos)) /* Assignment of value for TXADD in the DGI_SPI_SPITXADD register */
#define DGI_SPI_SPITXADD_Msk                  _UINT32_(0x0000FFFF)                                 /* (DGI_SPI_SPITXADD) Register Mask  */


/* -------- DGI_SPI_SPITXCNT : (DGI_SPI Offset: 0x50) (R/W 32) SPI DMA Transmit Count register -------- */
#define DGI_SPI_SPITXCNT_RESETVALUE           _UINT32_(0x00)                                       /*  (DGI_SPI_SPITXCNT) SPI DMA Transmit Count register  Reset Value */

#define DGI_SPI_SPITXCNT_TXCNT_Pos            _UINT32_(0)                                          /* (DGI_SPI_SPITXCNT) Transmit Count bitsThis register indicates the number of transferred data words. As the DMA progresses, TXCNT is constantly decremented to reflect the remaining count yet to be transferred. Position */
#define DGI_SPI_SPITXCNT_TXCNT_Msk            (_UINT32_(0xFFFF) << DGI_SPI_SPITXCNT_TXCNT_Pos)     /* (DGI_SPI_SPITXCNT) Transmit Count bitsThis register indicates the number of transferred data words. As the DMA progresses, TXCNT is constantly decremented to reflect the remaining count yet to be transferred. Mask */
#define DGI_SPI_SPITXCNT_TXCNT(value)         (DGI_SPI_SPITXCNT_TXCNT_Msk & (_UINT32_(value) << DGI_SPI_SPITXCNT_TXCNT_Pos)) /* Assignment of value for TXCNT in the DGI_SPI_SPITXCNT register */
#define DGI_SPI_SPITXCNT_Msk                  _UINT32_(0x0000FFFF)                                 /* (DGI_SPI_SPITXCNT) Register Mask  */


/* DGI_SPI register offsets definitions */
#define DGI_SPI_SPICON_REG_OFST        _UINT32_(0x00)      /* (DGI_SPI_SPICON) SPI control register Offset */
#define DGI_SPI_SPISTAT_REG_OFST       _UINT32_(0x10)      /* (DGI_SPI_SPISTAT) SPI Status register Offset */
#define DGI_SPI_SPIBUF_REG_OFST        _UINT32_(0x20)      /* (DGI_SPI_SPIBUF) SPI BUFFER register Offset */
#define DGI_SPI_SPIBRG_REG_OFST        _UINT32_(0x30)      /* (DGI_SPI_SPIBRG) SPI Baud rate register Offset */
#define DGI_SPI_SPITXADD_REG_OFST      _UINT32_(0x40)      /* (DGI_SPI_SPITXADD) SPI DMA Transmit Address register Offset */
#define DGI_SPI_SPITXCNT_REG_OFST      _UINT32_(0x50)      /* (DGI_SPI_SPITXCNT) SPI DMA Transmit Count register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* DGI_SPI register API structure */
typedef struct
{  /* SPI DMA for DGI Macro */
  __IO  uint32_t                       DGI_SPI_SPICON;     /* Offset: 0x00 (R/W  32) SPI control register */
  __I   uint8_t                        Reserved1[0x0C];
  __I   uint32_t                       DGI_SPI_SPISTAT;    /* Offset: 0x10 (R/   32) SPI Status register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       DGI_SPI_SPIBUF;     /* Offset: 0x20 (R/W  32) SPI BUFFER register */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       DGI_SPI_SPIBRG;     /* Offset: 0x30 (R/W  32) SPI Baud rate register */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       DGI_SPI_SPITXADD;   /* Offset: 0x40 (R/W  32) SPI DMA Transmit Address register */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       DGI_SPI_SPITXCNT;   /* Offset: 0x50 (R/W  32) SPI DMA Transmit Count register */
} dgi_spi_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ35_DGI_SPI_COMPONENT_H_ */
